## 1Ô∏è‚É£ Import Libraries

In [1]:
import numpy as np
import pandas as pd

### üîÉ Load Dataset

In [2]:
df = pd.read_csv(r"C:\Users\Asus Pc\Desktop\Mall_Customers.csv")
df

     customerid  gender  age  annual_income_(k$)  spending_score_(1-100)
0             1    male   19                  15                      39
1             2    male   21                  15                      81
2             4  female   23                  16                      77
3             5  female   31                  17                      40
4             6  female   22                  17                      76
..          ...     ...  ...                 ...                     ...
224         226  female   50                  67                      57
225         227    male   27                  67                      56
226         228  female   38                  67                      40
227         229  female   40                  69                      58
228         230    male   39                  69                      91

[229 rows x 5 columns]

### Explore the Data (EDA)

In [3]:
df.shape

(229, 5)

In [4]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
customerid,229.0,115.253275,66.565998,1.0,57.0,116.0,172.0,230.0
age,229.0,38.790393,13.344612,18.0,29.0,37.0,49.0,70.0
annual_income_(k$),229.0,60.174672,25.434903,15.0,40.0,62.0,78.0,137.0
spending_score_(1-100),229.0,50.218341,25.970892,1.0,32.0,51.0,73.0,99.0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 229 entries, 0 to 228
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customerid              229 non-null    int64
 1   gender                  224 non-null    object
 2   age                     229 non-null    int64
 3   annual_income_(k$)      229 non-null    int64
 4   spending_score_(1-100)  229 non-null    int64
dtypes: int64(4), object(1)
memory usage: 9.1+ KB

In [6]:
df.isnull().sum()

customerid                0
gender                    5
age                       0
annual_income_(k$)        0
spending_score_(1-100)    0
dtype: int64

In [7]:
df.duplicated().sum()

5

### Handle Missing Values

In [8]:
# Drop rows with nulls
df = df.dropna()

# OR fill missing Gender with "Unknown"
# df["Gender"] = df["Gender"].fillna("Unknown")

### Remove Duplicates

In [9]:
df = df.drop_duplicates()

### Standardize Text Values

In [10]:
df["gender"] = df["gender"].str.lower().str.strip()
df["gender"] = df["gender"].replace({"m": "male", "f": "female"})

### Rename Columns

In [11]:
df.columns = df.columns.str.lower().str.replace(" ", "_")

#### Check Data Types

In [12]:
print(df.dtypes)

# Convert age to int if needed
df["age"] = df["age"].astype(int)

# Annual income ‚Üí float
df["annual_income_(k$)"] = df["annual_income_(k$)"].astype(float)

customerid                 int64
gender                    object
age                        int64
annual_income_(k$)         int64
spending_score_(1-100)     int64
dtype: object

#### Save Cleaned Data

In [13]:
df.to_csv("Mall_Customers.csv", index=False)

In [14]:
df

     customerid  gender  age  annual_income_(k$)  spending_score_(1-100)
0             1    male   19                15.0                      39
1             2    male   21                15.0                      81
2             4  female   23                16.0                      77
3             5  female   31                17.0                      40
4             6  female   22                17.0                      76
..          ...     ...  ...                 ...                     ...
224         226  female   50                67.0                      57
225         227    male   27                67.0                      56
226         228  female   38                67.0                      40
227         229  female   40                69.0                      58
228         230    male   39                69.0                      91

[219 rows x 5 columns]